In [ ]:
#Import some required library
import numpy as np
import pandas as pd

In [ ]:
# Read Dataset
data=pd.read_csv("/content/drive/MyDrive/Data/titanic/train.csv")

In [ ]:
# check rows & columns using head () function
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Check number of rows & columns using shape function
data.shape

(891, 12)

In [ ]:
# Show Data information
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# check Null Values present in our data set using isnull().sum()
data.isnull().sum()/data.shape[0]*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [ ]:
data.drop(columns=["Cabin"],inplace=True)

In [ ]:
data.shape

(891, 11)

In [ ]:
#Creat null values for Sex column
null=np.random.choice(data.shape[0],size = 300, replace = False)
# null
# data.shape[0]
data.loc[null, 'Pclass'] = np.nan

In [ ]:
# data.iloc[rows,columns_index]
# data.loc[rows,columns_name]

In [ ]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass         300
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
removing_rows=data.copy() # Create Duplicate DataFrame
removing_rows.shape

(891, 11)

In [ ]:
# Drop Rows using dropna()function
removing_rows=removing_rows.dropna()

In [ ]:
print('Old Data Shape = ', data.shape)
print("New Data Shape = ", removing_rows.shape)

Old Data Shape =  (891, 11)
New Data Shape =  (482, 11)

# I looked their if used dropna function then 50 % data delete so In most of the cases removing the null values is not preferred. but if 2 % missing values are present in our data set & Feature more than 30 then used dropna function.

In [ ]:
# Imputing Missing Values through different methods.
# Numerical col fill mean & median
mean_median_data=data.copy()
mean_median_data['Pclass']=mean_median_data['Pclass'].fillna(mean_median_data['Pclass'].mean())
mean_median_data['Age']=mean_median_data['Age'].fillna(mean_median_data['Age'].median())

In [ ]:
mean_median_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
#Catgorical cols
mode_data=data.copy()
mode_data['Embarked']=mode_data['Embarked'].fillna(mode_data['Embarked'].mode()[0])

In [ ]:
mode_data.isnull().sum()

PassengerId      0
Survived         0
Pclass         300
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [ ]:
# Fill ffill & bfill Method
newf_data=data.copy()
newf_data['Embarked'].fillna(method='ffill',inplace=True)
newb_data=data.copy()
newb_data['Embarked'].fillna(method='bfill',inplace=True)

#Note- ffill and ffill Method should be applied to the time series dataset, if  i have stock value data set then use the ffill and bfill method to fill missing values.

In [ ]:
# sklearn imputer - Filling Missing Val
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer
impute_data=data.copy()
cols = impute_data.columns
indexs=impute_data.index
imputer=ColumnTransformer([
                        ('impute_age',SimpleImputer(),[5]),
                        ('impute_Pclass',SimpleImputer(strategy='median'),[2]),
                        ('impute_Embarked',SimpleImputer(strategy="most_frequent"),[10])
],remainder="passthrough")

In [ ]:
imputer.fit(impute_data)

ColumnTransformer(remainder='passthrough',
                  transformers=[('impute_age', SimpleImputer(), [5]),
                                ('impute_Pclass',
                                 SimpleImputer(strategy='median'), [2]),
                                ('impute_Embarked',
                                 SimpleImputer(strategy='most_frequent'),
                                 [10])])

In [ ]:
impute_data = imputer.transform(impute_data)

In [ ]:
impute_data

array([[22.0, 3.0, 'S', ..., 0, 'A/5 21171', 7.25],
       [38.0, 3.0, 'C', ..., 0, 'PC 17599', 71.2833],
       [26.0, 3.0, 'S', ..., 0, 'STON/O2. 3101282', 7.925],
       ...,
       [29.69911764705882, 3.0, 'S', ..., 2, 'W./C. 6607', 23.45],
       [26.0, 1.0, 'C', ..., 0, '111369', 30.0],
       [32.0, 3.0, 'Q', ..., 0, '370376', 7.75]], dtype=object)

In [ ]:
new_data=pd.DataFrame(impute_data,columns=cols,index=indexs)

In [ ]:
new_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
new_data.shape

(891, 11)